index.html
---
layout: default
title: index
---

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Development </h2>
<div class="outline-text-2" id="text-1">

<p>The development of Org-babel is tracked on <a href="http://github.com/eschulte/babel-dev/">github/babel-dev</a>.  This
repository contains:
</p><ul>
<li>
lists of pending development tasks;
</li>
<li>
lists of known and resolved bugs; and
</li>
<li>
the Org-babel functional test suite, which is implemented as a
large table and is run using Org-babel's spreadsheet
functionality.

</li>
</ul>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1">Recent Activity </h3>
<div class="outline-text-3" id="text-1.1">


     <ul>
       {% for post in site.posts limit:10 %}
       <li>
         <span class="timestamp">{{ post.date | date_to_string }}</span> <a href=".{{ post.url }}">{{ post.title }}</a>
       </li>
       {% endfor %}
     </ul>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2">Contributing </h3>
<div class="outline-text-3" id="text-1.2">

<p>Org-babel contributions are welcome! As for Org-mode, authors will
need to sign copyright papers with the FSF; please see the
<a href="http://orgmode.org/worg/org-contribute.php">instructions</a> for contributing to Org-mode.
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3">Publication </h3>
<div class="outline-text-3" id="text-1.3">

<p>This repository is published using the code at <a href="publish.html">publish.org</a>.
</p></div>
</div>
</div>
